Revit.Elements.Views.View.IsAnnotationView
Check if this type of view supports annotative elements
Returns:

Revit.Elements.Views.View.AddFilter(Revit.Filter.ParameterFilterElement)
Add a Filter to a View. The Filter will be added even if View has a View Template applied, which normally would prevent user from adding
Filters without first disabling or modifying the View Template.
parameterFilter: Parameter filter
View

Revit.Elements.Views.View.Filters
Get View Filters
View Filters

Revit.Elements.Views.View.SetFilterOverrides(Revit.Filter.ParameterFilterElement,Revit.Filter.OverrideGraphicSettings,System.Boolean)
Set Filter overrides. If View doesn't have specified Filter, it will be first added to the View and then its settings will be overriden.
This behavior will persist even if View has a View Template applied which normally would prevent user from adding Filters without first
disabling or modifying the View Template.
parameterFilter: Parameter Filter
overrides: Graphic Overrides Settings
hide: If True given Filter will be hidden.
View

Revit.Elements.Views.View.FilterOverrides(Revit.Filter.ParameterFilterElement)
Get Filter overrides
Filter overrides

Revit.Elements.Views.View.IsViewTemplate
Checks if View is a View Template.
Returns:

Revit.Elements.Views.View.SetCategoryOverrides(Revit.Elements.Category,Revit.Filter.OverrideGraphicSettings,System.Boolean)
Set Category Overrides.
category: Category
overrides: Graphics Overrides Settings.
hide: If True givent Category will be hidden.
View

Revit.Elements.Views.View.SetScale(System.Int32)
Set View Scale
scale: View scale is the ration of true model size to paper size.
View